#include "Lesson6PCH.h"

/*
1. Выделить в памяти динамический одномерный массив типа int. Размер массива запросить у пользователя. Инициализировать его числами степенями двойки: 1, 2, 4, 8, 16, 32, 64, 128 … 
   Вывести массив на экран. Не забыть освободить память. =) Разбить программу на функции.
2. Динамически выделить матрицу 4х4 типа int. Инициализировать ее псевдослучайными числами через функцию rand. Вывести на экран. 
   Разбейте вашу программу на функции которые вызываются из main.
3. Написать программу c 2-я функциями, которая создаст два текстовых файла (*.txt), примерно по 50-100 символов в каждом (особого значения не имеет с каким именно содержимым). 
   Имена файлов запросить у польлзователя.
4. Написать функцию, «склеивающую» эти файлы в третий текстовый файл (имя файлов спросить у пользователя).
5. Написать программу, которая проверяет присутствует ли указанное пользователем при запуске программы слово в указанном пользователем файле (для простоты работаем только с латиницей).
*/

int main(int argc, char* argv[])
{
	setlocale(LC_ALL, "");

	Tasks tasks;

//	tasks.Task1();
//	tasks.Task2();
//	tasks.Task3();	
//	tasks.Task4();
	tasks.Task5(argc > 1 ? argv[1] : "");

	return 0;
}


